[
  {
    "year": 2014,
    "projects": [
      {
        "url": "./game.php",
        "screenshotFileName": "zahlenratenScreenshot.png",
        "descriptionHtml": {
          "de": "Ein kleines Zahlenratespiel. Man hat sechs Versuche, eine Zahl zwischen 1 und 100 zu erraten und bekommt nach jedem Zug die Information, ob man zu hoch oder zu niedrig lag.",
          "en-us": "A little game for guessing numbers. You have six tries to guess an number between 1 and 100. After every guess you are told whether you guessed too high or too low."
        }
      },
      {
        "url": "./space",
        "screenshotFileName": "spaceinvadersScreenshot.png",
        "descriptionHtml": {
          "de": "Meine kleine Version von Spaceinvaders.",
          "en-us": "My little version of Spaceinvaders."
        }
      },
      {
        "url": "./stundenplaner",
        "screenshotFileName": "stundenplanerScreenshot.png",
        "descriptionHtml": {
          "de": "Ein Werkzeug, um Stundenpläne zu erstellen und zu bearbeiten.",
          "en-us": "A tool for creating schedules for school"
        }
      },
      {
        "url": "./Sani",
        "screenshotFileName": "saniV1Screenshot.png",
        "descriptionHtml": {
          "de": "Hier wird der Schulsanitätsdienst des Neuen Gymnasium Bochum (NGB) organisiert. Diese Applikation ist in der Version nicht mehr verfügbar, mittlwerweile befindet sich unter der URL die zweite Version des Projekts.",
          "en-us": "An application for organising the first aid group at my school <i>[deprecated]</i>"
        }
      },
      {
        "url": "./chat",
        "screenshotFileName": "chatScreenshot.png",
        "descriptionHtml": {
          "de": "Wer braucht schon WhatsApp, Skype etc. wenn er auch seinen eigenen kleinen (verbuggten) Chat hat?",
          "en-us": "Who needs WhatsApp if one has my little Chat?"
        }
      },
      {
        "url": "./timer",
        "screenshotFileName": "timerScreenshot.png",
        "descriptionHtml": {
          "de": "Ein Timer zum Speedcuben. Nichts besonderes, aber sehr nützlich zum Festhalten der Zeiten, der Bestzeit, der eigenen Entwicklung etc.",
          "en-us": "A little timer for speedcubing. Nothing special but very useful for keeping track of solve-times, high-scores, development etc."
        }
      }
    ]
  },
  {
    "year": 2015,
    "projects": [
      {
        "url": "./Sani",
        "screenshotFileName": "saniV2Screenshot.png",
        "descriptionHtml": {
          "de": "Das Update des Sani-Projektes auf Version 2. Außerdem ist das mein erstes Projekt mit AngularJS.",
          "en-us": "Version 2 of the first aid project. First project with AngularJS"
        }
      },
      {
        "url": "http://github.com/LBBO/CodeHighlighter",
        "screenshotFileName": "codehighlighterScreenshot.png",
        "descriptionHtml": {
          "de": "Mein erstes Open-Source-Projekt, eine Bibliothek die Code auf Webseiten färben kann, wie aus Notepad++ gewohnt.",
          "en-us": "My first open-source project. It highlights code as seen in Notepad++"
        }
      },
      {
        "url": "./TicTacToe",
        "screenshotFileName": "ticTacToeScreenshot.png",
        "descriptionHtml": {
          "de": "Zocken ist wieder angesagt! Spiele gegen den Computer Tic Tac Toe und probiere auch im Hardcore-Modus zu gewinnen!",
          "en-us": "Games! More Games! Today it's Tic Tac Toe and you are most welcome to challenge the computer or a friend of yours"
        }
      },
      {
        "url": "./Kaesekaestchen",
        "screenshotFileName": "kaesekaestchenScreenshot.png",
        "descriptionHtml": {
          "de": "Das Zocken geht weiter, diesmal aber mit Käsekästchen. Spiele mit 2-4 Spielern auf einem 2-11 x 2-11 Kästchen großen Feld!",
          "en-us": "Same day as Tic Tac Toe, different game. This time it's Käsekästchen. You can play in a group of 2-4 players"
        }
      }
    ]
  },
  {
    "year": 2016,
    "projects": [
      {
        "url": "./Sani/dev",
        "screenshotFileName": "saniV3Screenshot.png",
        "descriptionHtml": {
          "de": "Version 3 <i>[beta]</i> des Sani-Projektes. Ein Freund hat mir riesige Hilfe mit dem neuen Design gegeben. Außerdem wurden neue Features hinzugefügt und der Code wurde stark aufgeräumt.",
          "en-us": "Version 3 <i>[beta]</i> of the first aid project. A friend gave me some great help with the new design and I added lots of new features."
        }
      },
      {
        "url": "http://lbbo.de",
        "screenshotFileName": "lbboScreenshot.png",
        "descriptionHtml": {
          "de": "lbbo.de, mein eigener Link-Kürzer! Er bietet das erstellen von personalisierbaren Kurzlinks mit einstellbarem Ablaufdatum. Ich nutze ihn hauptsächlich zum Kürzen von Google-Docs-Links.",
          "en-us": "lbbo.de, my own link shortener! I use it mostly to shorten links Google Docs / Slides links down to a memorable link so that I don't need to memorize random codes. It offers custom links and expiration dates."
        }
      }
    ]
  },
  {
    "year": 2018,
    "projects": [
      {
        "url": "https://lbbo.github.io/ultimate-tic-tac-toe/",
        "screenshotFileName": "ultimateTicTacToeScreenshot.png",
        "descriptionHtml": {
          "de": "Nach langer Zeit kommt wieder ein Spiel: Ultimate Tic Tac Toe. Mein erstes Projekt mit React und das erste in der Liste, das <a href=\"https://github.com/LBBO/ultimate-tic-tac-toe\" target=\"_blank\">auf GitHub</a> zu finden ist.",
          "en-us": "After quite a while there is finally a new game: ultimate tic tac toe! This is my first project with React and the first project in this list that can be found <a href=\"https://github.com/LBBO/ultimate-tic-tac-toe\" target=\"_blank\">on GitHub</a>!"
        }
      }
    ]
  }
]
